In [1]:
import pandas as pd

In [2]:
ufo=pd.read_csv('http://bit.ly/uforeports')

In [3]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [4]:
ufo=pd.read_csv('http://bit.ly/uforeports',usecols=['City','Shape Reported'])

In [5]:
ufo

                       City Shape Reported
0                    Ithaca       TRIANGLE
1               Willingboro          OTHER
2                   Holyoke           OVAL
3                   Abilene           DISK
4      New York Worlds Fair          LIGHT
...                     ...            ...
18236            Grant Park       TRIANGLE
18237           Spirit Lake           DISK
18238           Eagle River            NaN
18239           Eagle River          LIGHT
18240                  Ybor           OVAL

[18241 rows x 2 columns]

In [6]:
ufo=pd.read_csv('http://bit.ly/uforeports',nrows=4)

In [7]:
ufo

          City  Colors Reported Shape Reported State             Time
0       Ithaca              NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro              NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke              NaN           OVAL    CO  2/15/1931 14:00
3      Abilene              NaN           DISK    KS   6/1/1931 13:00

In [10]:
for c in ufo.City:
    print(c)

Ithaca
Willingboro
Holyoke
Abilene

In [11]:
for index,row in ufo.iterrows():
    print(index,ufo.City,ufo.State)

0 0         Ithaca
1    Willingboro
2        Holyoke
3        Abilene
Name: City, dtype: object 0    NY
1    NJ
2    CO
3    KS
Name: State, dtype: object
1 0         Ithaca
1    Willingboro
2        Holyoke
3        Abilene
Name: City, dtype: object 0    NY
1    NJ
2    CO
3    KS
Name: State, dtype: object
2 0         Ithaca
1    Willingboro
2        Holyoke
3        Abilene
Name: City, dtype: object 0    NY
1    NJ
2    CO
3    KS
Name: State, dtype: object
3 0         Ithaca
1    Willingboro
2        Holyoke
3        Abilene
Name: City, dtype: object 0    NY
1    NJ
2    CO
3    KS
Name: State, dtype: object